In [1]:
%load_ext sql
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

In [2]:
%%sql
--Dropping tables for when we need to restart and clear CourseData database-- 

DROP TABLE IF EXISTS SECTION;
DROP TABLE IF EXISTS COURSE;
DROP TABLE IF EXISTS INSTRUCTOR;
DROP TABLE IF EXISTS COURSE_MEETINGS;

 * sqlite:///CourseData.db
Done.
Done.
Done.
Done.

[]

In [3]:
%%sql
-- Creating table INSTRUCTOR with surrogate primary key-- 

CREATE TABLE 'INSTRUCTOR' (
    InID INTEGER NOT NULL PRIMARY KEY,
    Name TEXT NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [4]:
%%sql
--Creating table COURSE with CatID as the primary key-- 

CREATE TABLE 'COURSE'(
    CatID VARCHAR PRIMARY KEY,
    Title VARCHAR NOT NULL,
    Description TEXT NOT NULL,
    Credits TEXT NOT NULL,
    PName TEXT NOT NULL,
    PCode TEXT,
    PREREQS TEXT,
    COREQS TEXT,
    FEES INTEGER,
    Attribute TEXT
    
);

 * sqlite:///CourseData.db
Done.

[]

In [5]:
%%sql
--Creating table SECTION with surrogate primary key-- 

CREATE TABLE 'SECTION'(
    SID INTEGER NOT NULL PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    Section VARCHAR NOT NULL,
    Cap INTEGER,
    Act INTEGER,
    Rem INTEGER,
    CatID VARCHAR,
    InID INTEGER,
    FOREIGN KEY (CatID) REFERENCES COURSE(CatID),
    FOREIGN KEY (InID) REFERENCES INSTRUCTOR(InID)
);

 * sqlite:///CourseData.db
Done.

[]

In [6]:
%%sql

--Creating table COURSE_MEETINGS with CatID as the Primary Key-- 

CREATE TABLE 'COURSE_MEETINGS' (
    MID INTEGER NOT NULL PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    Start TEXT NOT NULL,
    Location VARCHAR NOT NULL,
    Day TEXT NOT NULL,
    End TEXT NOT NULL,
    FOREIGN KEY (CRN) REFERENCES SECTION(CRN),
    FOREIGN KEY (Term) REFERENCES SECTION(Term)
);

 * sqlite:///CourseData.db
Done.

[]

In [7]:
%%sql

--Populating Course_Meetings table using import_course_meetings data-- 

INSERT INTO Course_Meetings (CRN, Term, Start, Location, Day, End)
SELECT DISTINCT crn, term, start, location, day, end 
FROM import_course_meetings;

 * sqlite:///CourseData.db
Done.

[]

In [8]:
%%sql 

--Checking data population of Course_Meetings table-- 

SELECT * 
FROM Course_Meetings
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'Fall2014', '2014-09-02T08:00:00', 'DSB 105', 'T', '2014-09-02T09:15:00'),
 (2, 70384, 'Fall2014', '2014-09-05T08:00:00', 'DSB 105', 'F', '2014-09-05T09:15:00'),
 (3, 70384, 'Fall2014', '2014-09-09T08:00:00', 'DSB 105', 'T', '2014-09-09T09:15:00'),
 (4, 70384, 'Fall2014', '2014-09-12T08:00:00', 'DSB 105', 'F', '2014-09-12T09:15:00'),
 (5, 70384, 'Fall2014', '2014-09-16T08:00:00', 'DSB 105', 'T', '2014-09-16T09:15:00'),
 (6, 70384, 'Fall2014', '2014-09-19T08:00:00', 'DSB 105', 'F', '2014-09-19T09:15:00'),
 (7, 70384, 'Fall2014', '2014-09-23T08:00:00', 'DSB 105', 'T', '2014-09-23T09:15:00'),
 (8, 70384, 'Fall2014', '2014-09-26T08:00:00', 'DSB 105', 'F', '2014-09-26T09:15:00'),
 (9, 70384, 'Fall2014', '2014-09-30T08:00:00', 'DSB 105', 'T', '2014-09-30T09:15:00'),
 (10, 70384, 'Fall2014', '2014-10-03T08:00:00', 'DSB 105', 'F', '2014-10-03T09:15:00')]

In [9]:
%%sql 

--Populating Course table using import_catalogs data--  

INSERT INTO COURSE (CatID, Title, Description, Credits, PName, PCode, PREREQS, COREQS, FEES, Attribute)
SELECT DISTINCT catalog_id, course_title, description, credits, program_name, program_code, prereqs, coreqs, fees, attributes
FROM import_catalogs;

 * sqlite:///CourseData.db
Done.

[]

In [10]:
%%sql 

--Checking data population of Course table-- 

SELECT * 
FROM COURSE
LIMIT 1;

 * sqlite:///CourseData.db
Done.

[('AN 0301', 'Independent Study', 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.', '1-3 Credits', 'Asian Studies', 'AN', '', '', '', '')]

In [11]:
%%sql 

--Populating Instructor table using import_courses data--  

INSERT INTO Instructor (Name)
SELECT DISTINCT primary_instructor
FROM import_courses
WHERE primary_instructor <> 'TBA' AND primary_instructor NOT LIKE 'primary_instructor' AND primary_instructor NOT LIKE '%/';

 * sqlite:///CourseData.db
Done.

[]

In [12]:
%%sql
SELECT * 
FROM INSTRUCTOR
WHERE NAME LIKE '%Huntley%';

 * sqlite:///CourseData.db
Done.

[(274, 'Christopher L.  Huntley')]

In [13]:
%%sql 

--Checking data population of Instructor table-- 

SELECT * 
FROM Instructor
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos')]

In [14]:
%%sql 

--Populating the SECTION table using import_courses data--
--Joining Instructor table using import_courses and instructor table--

INSERT INTO SECTION (CRN, Term, Section, Cap, Act, Rem, CatID, InID)
SELECT crn, term, section, cap, act, rem, catalog_id, InID
FROM import_courses
    JOIN Instructor ON (import_courses.primary_instructor = Instructor.Name)
;

 * sqlite:///CourseData.db
Done.

[]

In [15]:
%%sql 

--Checking data population of Section table--

SELECT * 
FROM Section
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'Fall2014', 'C01', 0, 31, -31, 'AC 0011', 1),
 (2, 70385, 'Fall2014', 'C02', 0, 31, -31, 'AC 0011', 1),
 (3, 70382, 'Fall2014', 'C03', 0, 31, -31, 'AC 0011', 1),
 (4, 70291, 'Fall2014', 'C04', 0, 29, -29, 'AC 0011', 2),
 (5, 70350, 'Fall2014', 'C05', 0, 30, -30, 'AC 0011', 2),
 (6, 70381, 'Fall2014', 'C06', 0, 31, -31, 'AC 0011', 2),
 (7, 70383, 'Fall2014', 'G', 30, 31, -1, 'AC 0011', 3),
 (8, 70391, 'Fall2014', 'H', 30, 32, -2, 'AC 0011', 4),
 (9, 71105, 'Fall2014', 'I', 30, 33, -3, 'AC 0011', 4),
 (10, 71123, 'Fall2014', 'J', 30, 32, -2, 'AC 0011', 4)]

In [16]:
%%sql
SELECT COUNT(CatID) 
FROM COURSE
WHERE Credits = '4 Credits' 
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(55,)]

In [17]:
%%sql
SELECT COUNT(InID) 
FROM Instructor 
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(1103,)]

In [18]:
%%sql 

SELECT (SUM(strftime('%s',End)-strftime('%s',Start))/60)/60 AS CourseHours, CRN, Location, Term
FROM Course_Meetings
WHERE LOCATION LIKE '%DSB%'
GROUP BY Location, Term
ORDER BY CourseHours DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(843, 74648, 'DSB 106', 'Fall2018'),
 (837, 37397, 'DSB 111', 'Spring2016'),
 (833, 71437, 'DSB 112', 'Fall2014'),
 (816, 37510, 'DSB 105', 'Spring2019'),
 (816, 37042, 'DSB 110', 'Spring2016'),
 (796, 31297, 'DSB 111', 'Spring2017'),
 (792, 31427, 'DSB 109', 'Spring2017'),
 (790, 75222, 'DSB 112', 'Fall2015'),
 (775, 37271, 'DSB 114', 'Spring2016'),
 (757, 70070, 'DSB 110B', 'Fall2014')]

In [19]:
%%sql
SELECT COUNT(InID) AS CoursesTaught, InID, Term
FROM SECTION
GROUP BY InID, Term
ORDER BY CoursesTaught DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(108, 730, 'Fall2017'),
 (64, 173, 'Fall2017'),
 (54, 730, 'Fall2018'),
 (51, 730, 'Fall2016'),
 (50, 245, 'Fall2015'),
 (46, 245, 'Fall2014'),
 (32, 173, 'Spring2016'),
 (31, 173, 'Fall2015'),
 (31, 173, 'Fall2016'),
 (31, 173, 'Spring2017')]

In [20]:
%%sql
SELECT * 
FROM Instructor 
Where InID = '173';

 * sqlite:///CourseData.db
Done.

[(173, 'Sonya R.  Huber')]

In [21]:
%%sql 
SELECT InID, Term, Name, Count(Name) AS CoursesTaught
FROM Instructor
    JOIN SECTION USING (InID)
GROUP BY InID, Term
ORDER BY CoursesTaught ASC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'Summer2017', 'Michael P.  Coyne', 1),
 (1, 'Summer2018', 'Michael P.  Coyne', 1),
 (6, 'Spring2015', 'Scott M  Brenner', 1),
 (6, 'Spring2016', 'Scott M  Brenner', 1),
 (6, 'Spring2017', 'Scott M  Brenner', 1),
 (6, 'Spring2018', 'Scott M  Brenner', 1),
 (7, 'Fall2014', 'Kevin C.  Cassidy', 1),
 (7, 'Spring2016', 'Kevin C.  Cassidy', 1),
 (10, 'Fall2015', 'Stephen E.  Yost', 1),
 (10, 'Fall2016', 'Stephen E.  Yost', 1)]

In [22]:
%%sql 
SELECT AVG(CAP) as AverageCapacity
FROM SECTION 
WHERE CAP>10;

 * sqlite:///CourseData.db
Done.

[(22.9560507107184,)]

In [23]:
# Huntley

In [78]:
%%sql 
SELECT CATID, Title, Name, COUNT(InID) AS TimesTaught
FROM Course
    JOIN SECTION USING (CatID)
    JOIN INSTRUCTOR USING (InID)
WHERE NAME LIKE "%Huntley%"
GROUP BY CatID
ORDER BY TimesTaught DESC;

 * sqlite:///CourseData.db
Done.

[('OM 0101', 'Operations Management', 'Christopher L.  Huntley', 7),
 ('IS 0240', 'Systems Analysis and Logical Design', 'Christopher L.  Huntley', 5),
 ('IS 0320', 'Systems Design and Implementation', 'Christopher L.  Huntley', 4),
 ('IS 0399', 'Independent Study', 'Christopher L.  Huntley', 4),
 ('IS 0100', 'Introduction to Information Systems', 'Christopher L.  Huntley', 3),
 ('IS 0135', 'Fundamentals of Web Design', 'Christopher L.  Huntley', 3),
 ('IS 0505', 'Python for Business Analytics', 'Christopher L.  Huntley', 2),
 ('IS 0510', 'Databases for Business Analytics', 'Christopher L.  Huntley', 2),
 ('IS 0260', 'Database Systems', 'Christopher L.  Huntley', 1),
 ('IS 0585', 'Contemporary Topics in Information Systems and Operations Management', 'Christopher L.  Huntley', 1)]

In [76]:
%%sql 
SELECT TERM, Name, CatID
FROM SECTION 
    JOIN INSTRUCTOR USING (InID)
    JOIN COURSE USING (CatID)
WHERE NAME LIKE '%Huntley'AND CatID = "IS 0100";

 * sqlite:///CourseData.db
Done.

[('Fall2014', 'Christopher L.  Huntley', 'IS 0100'),
 ('Fall2015', 'Christopher L.  Huntley', 'IS 0100'),
 ('Fall2015', 'Christopher L.  Huntley', 'IS 0100')]

In [79]:
%%sql 
SELECT Name, ((SUM(strftime('%s',End)-strftime('%s',Start)))/60)/60 AS CourseHours, Term
FROM Course_Meetings
    JOIN SECTION USING (CRN, Term)
    JOIN INSTRUCTOR USING (InID)
    JOIN COURSE USING (CatID)
WHERE NAME LIKE "%Huntley%"
GROUP BY Term
ORDER BY CourseHours DESC;

 * sqlite:///CourseData.db
Done.

[('Christopher L.  Huntley', 447, 'Fall2017'),
 ('Christopher L.  Huntley', 130, 'Fall2015'),
 ('Christopher L.  Huntley', 118, 'Spring2016'),
 ('Christopher L.  Huntley', 102, 'Spring2017'),
 ('Christopher L.  Huntley', 102, 'Spring2018'),
 ('Christopher L.  Huntley', 97, 'Fall2014'),
 ('Christopher L.  Huntley', 70, 'Fall2018'),
 ('Christopher L.  Huntley', 65, 'Fall2016'),
 ('Christopher L.  Huntley', 62, 'Spring2019')]

In [82]:
%%sql 
SELECT Name, Term, CRN, CatID
FROM Course
    JOIN SECTION USING (CatID)
    JOIN INSTRUCTOR USING (InID)
WHERE NAME LIKE "%Huntley%" AND Term = "Fall2017";

 * sqlite:///CourseData.db
Done.

[('Christopher L.  Huntley', 'Fall2017', 71153, 'IS 0240'),
 ('Christopher L.  Huntley', 'Fall2017', 73088, 'IS 0399'),
 ('Christopher L.  Huntley', 'Fall2017', 72913, 'IS 0505'),
 ('Christopher L.  Huntley', 'Fall2017', 72914, 'IS 0510'),
 ('Christopher L.  Huntley', 'Fall2017', 71153, 'IS 0240'),
 ('Christopher L.  Huntley', 'Fall2017', 73088, 'IS 0399'),
 ('Christopher L.  Huntley', 'Fall2017', 72913, 'IS 0505'),
 ('Christopher L.  Huntley', 'Fall2017', 72914, 'IS 0510')]

In [71]:
%%sql 
SELECT Name, Location, COUNT(Location) AS NumClassMeetings
FROM Course_Meetings
    JOIN SECTION USING (CRN, Term)
    JOIN INSTRUCTOR USING (InID)
    JOIN COURSE USING (CatID)
WHERE NAME LIKE "%Huntley%"
GROUP BY Location
ORDER BY NumClassMeetings DESC;

 * sqlite:///CourseData.db
Done.

[('Christopher L.  Huntley', 'DSB 106', 108),
 ('Christopher L.  Huntley', 'DSB 110B', 105),
 ('Christopher L.  Huntley', 'DSB 115', 91),
 ('Christopher L.  Huntley', 'DSB 109', 66),
 ('Christopher L.  Huntley', 'DSB 110A', 52),
 ('Christopher L.  Huntley', 'DSB 114', 52),
 ('Christopher L.  Huntley', 'DSB 108', 29),
 ('Christopher L.  Huntley', 'DSB 111', 28),
 ('Christopher L.  Huntley', 'DSB 112', 27),
 ('Christopher L.  Huntley', 'DSB 107', 26),
 ('Christopher L.  Huntley', 'DSB 104', 14),
 ('Christopher L.  Huntley', 'DSB 2109A', 14)]

In [85]:
%%sql 
SELECT ((SUM(strftime('%s',End)-strftime('%s',Start)))/60)/60 AS CourseHours, Day
FROM Course_Meetings
WHERE DAY <> 'day'
GROUP BY Day
ORDER BY CourseHours DESC;

 * sqlite:///CourseData.db
Done.

[(116562, 'T'),
 (111245, 'R'),
 (108106, 'M'),
 (96924, 'W'),
 (68230, 'F'),
 (7143, 'S'),
 (956, 'U')]

In [87]:
%%sql 
SELECT ((SUM(strftime('%s',End)-strftime('%s',Start)))/60)/60 AS CourseHours, Day, Name
FROM Course_Meetings
    JOIN SECTION USING (CRN, Term)
    JOIN Instructor USING (InID)
WHERE DAY <> 'day'AND Name LIKE '%Huntley%'
GROUP BY Day
ORDER BY CourseHours DESC;

 * sqlite:///CourseData.db
Done.

[(498, 'T', 'Christopher L.  Huntley'),
 (336, 'W', 'Christopher L.  Huntley'),
 (183, 'R', 'Christopher L.  Huntley'),
 (173, 'M', 'Christopher L.  Huntley'),
 (141, 'S', 'Christopher L.  Huntley'),
 (100, 'F', 'Christopher L.  Huntley')]